<?php

return [
    // [
    //     // 插件名称，顶级不填写则以xbCode为插件名称
    //     "plugin" => "xbCode",
    //     // 插件标题
    //     "title" => "系统配置",
    //     // 插件地址
    //     "path" => "Config",
    //     // 请求方式，可以是数组或字符串，字符串示例: GET,POST,PUT,DELETE
    //     "method" => "GET",
    //     // 菜单类型：10目录，20菜单，30:按钮
    //     "type" => "10",
    //     // 菜单图标
    //     "icon" => "DashboardOutlined",
    //     // 菜单参数，组件类型是远程组件时，该处写组件接口地址
    //     "params" => "",
    //     // 是否显示：10隐藏，20显示
    //     "is_show" => 20,
    //     // 菜单排序，默认值越小越靠前
    //     "sort" => 9999,
    //     // 父级菜单地址，不填写或不存在时为顶级菜单
    //     "pid" => "",
    //     // 继续添加子菜单
    //     "children" => [
    //         [
    //             // 以下参数如上，pid自动获取当前父级菜单地址
    //             "title" => "字典管理",
    //             "path" => "admin/Dict/index",
    //             "method" => "GET",
    //             "type" => "20",
    //             "icon" => "",
    //             "params" => "",
    //             "is_show" => 20,
    //             "children" => [
    //                 // 按照上面的格式可以继续添加子菜单
    //             ],
    //         ],
    //     ],
    // ],
];
