<?php

return [
    // [
    //     // 字典名称
    //     'title' => '封禁状态文字',
    //     // 标签名称
    //     'name' => 'banText',
    //     'children' => [
    //         [
    //             // 字典数据名称
    //             'label' => '未封禁',
    //             // 字典数据参数
    //             'value' => '10',
    //             // 字典排序，值越小则越靠前
    //             'sort' => '0',
    //             // 字典状态 10禁用 20启用
    //             'state' => '20',
    //         ],
    //         [
    //             // 字典数据名称
    //             'label' => '已封禁',
    //             // 字典数据参数
    //             'value' => '20',
    //             // 字典排序，值越小则越靠前
    //             'sort' => '0',
    //             // 字典状态 10禁用 20启用
    //             'state' => '20',
    //         ],
    //     ],
    // ],
];